  [
  
    {
  "name": "Upper legs",
  "plans": [
    {
      "bodyPart": "upper legs",
      "equipment": "body weight",
     "gifUrl": "https://v2.exercisedb.io/image/70BuPzgxqbGEnq",
      "id": "1512",
      "name": "all fours squad stretch",
      "target": "quads",
      "secondaryMuscles": [
          "hamstrings",
          "glutes"
      ],
      "instructions": [
          "Start on all fours with your hands directly under your shoulders and your knees directly under your hips.",
          "Extend one leg straight back, keeping your knee bent and your foot flexed.",
          "Slowly lower your hips towards the ground, feeling a stretch in your quads.",
          "Hold this position for 20-30 seconds.",
          "Switch legs and repeat the stretch on the other side."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/UYx28OEDDsQLVP",
      "id": "3214",
      "name": "arms apart circular toe touch (male)",
      "target": "glutes",
      "secondaryMuscles": [
          "hamstrings",
          "quadriceps",
          "calves"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and arms extended to the sides.",
          "Keeping your legs straight, bend forward at the waist and reach down towards your toes with your right hand.",
          "As you reach down, simultaneously lift your left leg straight up behind you, maintaining balance.",
          "Return to the starting position and repeat the movement with your left hand reaching towards your toes and your right leg lifting up behind you.",
          "Continue alternating sides for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/MFNjA3lJvHZzI0",
      "id": "1709",
      "name": "assisted lying glutes stretch",
      "target": "glutes",
      "secondaryMuscles": [
          "hamstrings"
      ],
      "instructions": [
          "Lie on your back with your legs extended.",
          "Bend your right knee and place your right ankle on your left thigh, just above the knee.",
          "Grasp your left thigh with both hands and gently pull it towards your chest.",
          "Hold the stretch for 20-30 seconds.",
          "Release and repeat on the other side."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/Ybnt8wVSXkG6Vz",
      "id": "1710",
      "name": "assisted lying gluteus and piriformis stretch",
      "target": "glutes",
      "secondaryMuscles": [
          "hamstrings"
      ],
      "instructions": [
          "Lie on your back with your legs extended.",
          "Bend your right knee and place your right ankle on your left thigh, just above the knee.",
          "Grasp your left thigh with both hands and gently pull it towards your chest.",
          "Hold the stretch for 20-30 seconds.",
          "Release the stretch and repeat on the other side."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/w2GedRi-X5uJGj",
      "id": "0016",
      "name": "assisted prone hamstring",
      "target": "hamstrings",
      "secondaryMuscles": [
          "glutes",
          "lower back"
      ],
      "instructions": [
          "Lie face down on a mat or bench with your legs fully extended.",
          "Have a partner or use a resistance band to secure your ankles.",
          "Engage your hamstrings and lift your legs towards your glutes, keeping your knees straight.",
          "Pause for a moment at the top, then slowly lower your legs back down to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/YCmXRokJ35c4wq",
      "id": "1713",
      "name": "assisted prone lying quads stretch",
      "target": "quads",
      "secondaryMuscles": [
          "hamstrings",
          "glutes"
      ],
      "instructions": [
          "Lie face down on the ground with your legs extended.",
          "Bend your left knee and reach back with your left hand to grab your left foot or ankle.",
          "Gently pull your left foot towards your glutes, feeling a stretch in your left quad.",
          "Hold the stretch for 20-30 seconds, then release.",
          "Repeat with your right leg."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/UniPdhG9rxseDG",
      "id": "1712",
      "name": "assisted side lying adductor stretch",
      "target": "adductors",
      "secondaryMuscles": [
          "hamstrings",
          "glutes"
      ],
      "instructions": [
          "Lie on your side with your legs straight and stacked on top of each other.",
          "Bend your bottom leg slightly for stability.",
          "Place your top foot on a stable surface, such as a bench or step.",
          "Keeping your top leg straight, slowly lower it towards the ground, feeling a stretch in your inner thigh.",
          "Hold the stretch for 20-30 seconds.",
          "Return to the starting position and repeat on the other side."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/2Ymsbb68SdOFFS",
      "id": "1473",
      "name": "backward jump",
      "target": "quads",
      "secondaryMuscles": [
          "hamstrings",
          "glutes",
          "calves"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart.",
          "Bend your knees slightly and jump backwards, pushing off with both feet.",
          "Land softly on the balls of your feet, bending your knees to absorb the impact.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/z1ELsrMakT2bCH",
      "id": "0020",
      "name": "balance board",
      "target": "quads",
      "secondaryMuscles": [
          "calves",
          "hamstrings",
          "glutes"
      ],
      "instructions": [
          "Place the balance board on a flat surface.",
          "Step onto the balance board with one foot, ensuring it is centered.",
          "Slowly shift your weight onto the foot on the balance board, keeping your core engaged.",
          "Maintain your balance and stability as you hold the position for a desired amount of time.",
          "Repeat the exercise with the other foot."
      ]
  },
  {
      "bodyPart": "upper legs",
      "equipment": "band",
      "gifUrl": "https://v2.exercisedb.io/image/t3YGBiDBzu4KTf",
      "id": "0980",
      "name": "band bent-over hip extension",
      "target": "glutes",
      "secondaryMuscles": [
          "hamstrings",
          "lower back"
      ],
      "instructions": [
          "Attach the band to a sturdy anchor point at ankle height.",
          "Stand facing away from the anchor point with your feet shoulder-width apart.",
          "Step back to create tension in the band, keeping your knees slightly bent.",
          "Hinge at the hips and lean forward, maintaining a neutral spine.",
          "Extend your right leg straight back, squeezing your glutes at the top.",
          "Lower your right leg back down and repeat with the left leg.",
          "Continue alternating legs for the desired number of repetitions."
      ]
  }
  ]
},
{
  "name": "Upper Arms",
  "plans": [
    {
      "bodyPart": "upper arms",
      "equipment": "assisted",
      "gifUrl": "https://v2.exercisedb.io/image/ZVpwWAmk7YwRHF",
      "id": "0018",
      "name": "assisted standing triceps extension (with towel)",
      "target": "triceps",
      "secondaryMuscles": [
          "shoulders"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and hold a towel with both hands behind your head.",
          "Keep your elbows close to your ears and your upper arms stationary.",
          "Slowly extend your forearms upward, squeezing your triceps at the top.",
          "Pause for a moment, then slowly lower the towel back down to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "leverage machine",
      "gifUrl": "https://v2.exercisedb.io/image/XdYZUFZk8BWqlV",
      "id": "0019",
      "name": "assisted triceps dip (kneeling)",
      "target": "triceps",
      "secondaryMuscles": [
          "chest",
          "shoulders"
      ],
      "instructions": [
          "Adjust the machine to your desired weight and height.",
          "Kneel down on the pad facing the machine, with your hands gripping the handles.",
          "Lower your body by bending your elbows, keeping your back straight and close to the machine.",
          "Pause for a moment at the bottom, then push yourself back up to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "band",
      "gifUrl":"https://v2.exercisedb.io/image/4L2ePplopKFw6l",
      "id": "0968",
      "name": "band alternating biceps curl",
      "target": "biceps",
      "secondaryMuscles": [
          "forearms"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and hold the band with an underhand grip, palms facing up.",
          "Keep your elbows close to your sides and slowly curl one arm up towards your shoulder, squeezing your biceps at the top.",
          "Lower the arm back down to the starting position and repeat with the other arm.",
          "Continue alternating arms for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "band",
      "gifUrl": "https://v2.exercisedb.io/image/slEyF6-QyrCNoD",
      "id": "0975",
      "name": "band close-grip push-up",
      "target": "triceps",
      "secondaryMuscles": [
          "chest",
          "shoulders"
      ],
      "instructions": [
          "Place a band around your upper arms, just above the elbows.",
          "Assume a push-up position with your hands directly under your shoulders and your body in a straight line from head to heels.",
          "Bend your elbows and lower your chest towards the ground, keeping your elbows close to your sides.",
          "Push through your palms to extend your arms and return to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "band",
      "gifUrl": "https://v2.exercisedb.io/image/grc2Xc6emZzC3-",
      "id": "0976",
      "name": "band concentration curl",
      "target": "biceps",
      "secondaryMuscles": [
          "forearms"
      ],
      "instructions": [
          "Sit on a bench or chair with your legs spread apart and your feet flat on the ground.",
          "Hold one end of the band in your hand and step on the other end with your foot on the same side.",
          "Lean forward slightly and rest your elbow on the inside of your thigh, just above the knee.",
          "With your palm facing up, slowly curl your hand towards your shoulder, keeping your upper arm stationary.",
          "Pause for a moment at the top, then slowly lower your hand back down to the starting position.",
          "Repeat for the desired number of repetitions, then switch sides."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "band",
      "gifUrl": "https://v2.exercisedb.io/image/sRdfql3NIft6d9",
      "id": "0986",
      "name": "band one arm overhead biceps curl",
      "target": "biceps",
      "secondaryMuscles": [
          "forearms",
          "shoulders"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and place one end of the band under your foot.",
          "Hold the other end of the band with your arm fully extended overhead, palm facing forward.",
          "Keeping your upper arm stationary, curl your forearm towards your shoulder, squeezing your biceps.",
          "Pause for a moment at the top, then slowly lower your forearm back to the starting position.",
          "Repeat for the desired number of repetitions, then switch arms."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "band",
      "gifUrl": "https://v2.exercisedb.io/image/6gvQc-yI0aYyXZ",
      "id": "0998",
      "name": "band side triceps extension",
      "target": "triceps",
      "secondaryMuscles": [
          "shoulders"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and hold the band with both hands, palms facing down.",
          "Extend your arms straight out to the sides, keeping them parallel to the ground.",
          "Slowly bend your elbows and bring your hands towards your shoulders, keeping your upper arms still.",
          "Pause for a moment, then slowly extend your arms back out to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "barbell",
      "gifUrl": "https://v2.exercisedb.io/image/xwZbZpfaa6sw5p",
      "id": "0023",
      "name": "barbell alternate biceps curl",
      "target": "biceps",
      "secondaryMuscles": [
          "forearms"
      ],
      "instructions": [
          "Stand up straight with your feet shoulder-width apart and hold a barbell in each hand, palms facing forward.",
          "Keep your upper arms stationary and exhale as you curl the weights while contracting your biceps.",
          "Continue to raise the barbells until your biceps are fully contracted and the barbells are at shoulder level.",
          "Hold the contracted position for a brief pause as you squeeze your biceps.",
          "Inhale as you slowly begin to lower the barbells back to the starting position.",
          "Repeat for the desired number of repetitions, alternating arms."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "barbell",
      "gifUrl": "https://v2.exercisedb.io/image/LJtd1hUFkVzIGR",
      "id": "2407",
      "name": "barbell biceps curl (with arm blaster)",
      "target": "biceps",
      "secondaryMuscles": [
          "forearms"
      ],
      "instructions": [
          "Stand up straight with your feet shoulder-width apart and hold a barbell with an underhand grip, palms facing up.",
          "Place your upper arms against the arm blaster, keeping your elbows close to your torso.",
          "Keeping your upper arms stationary, exhale and curl the weights while contracting your biceps.",
          "Continue to raise the barbell until your biceps are fully contracted and the bar is at shoulder level.",
          "Hold the contracted position for a brief pause as you squeeze your biceps.",
          "Inhale and slowly begin to lower the barbell back to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "upper arms",
      "equipment": "barbell",
      "gifUrl": "https://v2.exercisedb.io/image/cCf2u1qKA3x1zr",
      "id": "0030",
      "name": "barbell close-grip bench press",
      "target": "triceps",
      "secondaryMuscles": [
          "chest",
          "shoulders"
      ],
      "instructions": [
          "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
          "Grasp the barbell with a close grip, slightly narrower than shoulder-width apart.",
          "Unrack the barbell and lower it slowly towards your chest, keeping your elbows close to your body.",
          "Pause for a moment when the barbell touches your chest.",
          "Push the barbell back up to the starting position, fully extending your arms.",
          "Repeat for the desired number of repetitions."
      ]
  }
  ]
},
{
  "name": "Waist",
  "plans": [
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/8QLcMDTCEKsfQy",
      "id": "0001",
      "name": "3/4 sit-up",
      "target": "abs",
      "secondaryMuscles": [
          "hip flexors",
          "lower back"
      ],
      "instructions": [
          "Lie flat on your back with your knees bent and feet flat on the ground.",
          "Place your hands behind your head with your elbows pointing outwards.",
          "Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is at a 45-degree angle.",
          "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
          "Repeat for the desired number of repetitions."
      ]
  },
  {
      "bodyPart": "waist",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/4RdYx027WNOk8U",
      "id": "0002",
      "name": "45° side bend",
      "target": "abs",
      "secondaryMuscles": [
          "obliques"
      ],
      "instructions": [
          "Stand with your feet shoulder-width apart and your arms extended straight down by your sides.",
          "Keeping your back straight and your core engaged, slowly bend your torso to one side, lowering your hand towards your knee.",
          "Pause for a moment at the bottom, then slowly return to the starting position.",
          "Repeat on the other side.",
          "Continue alternating sides for the desired number of repetitions."
      ]
  },
  {
    "bodyPart": "waist",
    "equipment": "body weight",
    "gifUrl":"https://v2.exercisedb.io/image/CX8ihyrz447knY",
    "id": "0003",
    "name": "air bike",
    "target": "abs",
    "secondaryMuscles": [
        "hip flexors"
    ],
    "instructions": [
        "Lie flat on your back with your hands placed behind your head.",
        "Lift your legs off the ground and bend your knees at a 90-degree angle.",
        "Bring your right elbow towards your left knee while simultaneously straightening your right leg.",
        "Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.",
        "Continue alternating sides in a pedaling motion for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/5fHosTUyOPgNVM",
    "id": "0006",
    "name": "alternate heel touchers",
    "target": "abs",
    "secondaryMuscles": [
        "obliques"
    ],
    "instructions": [
        "Lie flat on your back with your knees bent and feet flat on the ground.",
        "Extend your arms straight out to the sides, parallel to the ground.",
        "Engaging your abs, lift your shoulders off the ground and reach your right hand towards your right heel.",
        "Return to the starting position and repeat on the left side, reaching your left hand towards your left heel.",
        "Continue alternating sides for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/wGKavaaeQSrcBM",
    "id": "2355",
    "name": "arm slingers hanging bent knee legs",
    "target": "abs",
    "secondaryMuscles": [
        "shoulders",
        "back"
    ],
    "instructions": [
        "Hang from a pull-up bar with your arms fully extended and your knees bent at a 90-degree angle.",
        "Engage your core and lift your knees towards your chest, bringing them as close to your elbows as possible.",
        "Slowly lower your legs back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "body weight",
    "gifUrl":"https://v2.exercisedb.io/image/c6wZ0rBphSn22R",
    "id": "2333",
    "name": "arm slingers hanging straight legs",
    "target": "abs",
    "secondaryMuscles": [
        "shoulders",
        "back"
    ],
    "instructions": [
        "Hang from a pull-up bar with your arms fully extended and your legs straight down.",
        "Engage your core and lift your legs up in front of you until they are parallel to the ground.",
        "Hold for a moment at the top, then slowly lower your legs back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/LtxTSHAHPgYhFU",
    "id": "3204",
    "name": "arms overhead full sit-up (male)",
    "target": "abs",
    "secondaryMuscles": [
        "hip flexors",
        "lower back"
    ],
    "instructions": [
        "Lie flat on your back with your knees bent and feet flat on the ground.",
        "Extend your arms overhead, keeping them straight.",
        "Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is upright.",
        "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "assisted",
    "gifUrl": "https://v2.exercisedb.io/image/7tzbjet9i76eTA",
    "id": "0011",
    "name": "assisted hanging knee raise",
    "target": "abs",
    "secondaryMuscles": [
        "hip flexors"
    ],
    "instructions": [
        "Hang from a pull-up bar with your arms fully extended and your palms facing away from you.",
        "Engage your core muscles and lift your knees towards your chest, bending at the hips and knees.",
        "Pause for a moment at the top of the movement, squeezing your abs.",
        "Slowly lower your legs back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "assisted",
    "gifUrl": "https://v2.exercisedb.io/image/kQp-ws9T-cjz8e",
    "id": "0010",
    "name": "assisted hanging knee raise with throw down",
    "target": "abs",
    "secondaryMuscles": [
        "hip flexors",
        "lower back"
    ],
    "instructions": [
        "Hang from a pull-up bar with your arms fully extended and your palms facing away from you.",
        "Engage your core and lift your knees towards your chest, keeping your legs together.",
        "Once your knees are at chest level, explosively throw your legs down towards the ground, extending them fully.",
        "Allow your legs to swing back up and repeat the movement for the desired number of repetitions."
    ]
},
{
    "bodyPart": "waist",
    "equipment": "assisted",
    "gifUrl": "https://v2.exercisedb.io/image/c6wZ0rBphSn22R",
    "id": "0012",
    "name": "assisted lying leg raise with lateral throw down",
    "target": "abs",
    "secondaryMuscles": [
        "hip flexors",
        "obliques"
    ],
    "instructions": [
        "Lie flat on your back with your legs extended and your arms by your sides.",
        "Place your hands under your glutes for support.",
        "Engage your abs and lift your legs off the ground, keeping them straight.",
        "While keeping your legs together, lower them to one side until they are a few inches above the ground.",
        "Pause for a moment, then lift your legs back to the starting position.",
        "Repeat the movement to the other side.",
        "Continue alternating sides for the desired number of repetitions."
    ]
}
]
},
{
"name": "Back",
"plans": [
{
    "bodyPart": "back",
    "equipment": "cable",
    "gifUrl": "https://v2.exercisedb.io/image/e2atO6pt4JE2Ak",
    "id": "0007",
    "name": "alternate lateral pulldown",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "rhomboids"
    ],
    "instructions": [
        "Sit on the cable machine with your back straight and feet flat on the ground.",
        "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
        "Lean back slightly and pull the handles towards your chest, squeezing your shoulder blades together.",
        "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/B4HGHRLmk6OXfH",
    "id": "3293",
    "name": "archer pull up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Start by hanging from a pull-up bar with an overhand grip, slightly wider than shoulder-width apart.",
        "Engage your core and pull your shoulder blades down and back.",
        "As you pull yourself up, bend one arm and bring your elbow towards your side, while keeping the other arm straight.",
        "Continue pulling until your chin is above the bar and your bent arm is fully flexed.",
        "Lower yourself back down with control, straightening the bent arm and repeating the movement on the other side.",
        "Alternate sides with each repetition."
    ]
},
{
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/1SHadaWOnoKwY1",
    "id": "0015",
    "name": "assisted parallel close grip pull-up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Adjust the machine to your desired weight and height.",
        "Place your hands on the parallel bars with a close grip, palms facing each other.",
        "Hang from the bars with your arms fully extended and your feet off the ground.",
        "Engage your back muscles and pull your body up towards the bars, keeping your elbows close to your body.",
        "Continue pulling until your chin is above the bars.",
        "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/jPrVqKIwBKzg2y",
    "id": "0017",
    "name": "assisted pull-up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Adjust the machine to your desired weight and height settings.",
        "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
        "Hang with your arms fully extended and your feet off the ground.",
        "Engage your back muscles and pull your body up towards the handles, keeping your elbows close to your body.",
        "Continue pulling until your chin is above the handles.",
        "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/oFMmM2Lt5zAGxc",
    "id": "1431",
    "name": "assisted standing chin-up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Adjust the machine to your desired assistance level.",
        "Stand on the foot platform and grip the handles with an overhand grip, slightly wider than shoulder-width apart.",
        "Keep your chest up and shoulders back, engage your core, and slightly bend your knees.",
        "Pull your body up by flexing your elbows and driving your elbows down towards your sides.",
        "Continue pulling until your chin is above the bar.",
        "Pause for a moment at the top, then slowly lower your body back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "leverage machine",
    "gifUrl": "https://v2.exercisedb.io/image/YPPyG7BunfLsje",
    "id": "1432",
    "name": "assisted standing pull-up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Adjust the machine to your desired weight and height settings.",
        "Stand facing the machine with your feet shoulder-width apart.",
        "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
        "Engage your lats and biceps, and pull yourself up towards the handles.",
        "Pause for a moment at the top, squeezing your back muscles.",
        "Slowly lower yourself back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "stability ball",
    "gifUrl": "https://v2.exercisedb.io/image/tDLUVhupOY5SO8",
    "id": "1314",
    "name": "back extension on exercise ball",
    "target": "spine",
    "secondaryMuscles": [
        "glutes",
        "hamstrings"
    ],
    "instructions": [
        "Place the stability ball on the ground and lie face down on top of it, with your hips resting on the ball and your feet against a wall or other stable surface.",
        "Position your hands behind your head or crossed over your chest.",
        "Engage your core and slowly lift your upper body off the ball, extending your back until your body forms a straight line from your head to your heels.",
        "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/wgAV8S1NxNtO6e",
    "id": "3297",
    "name": "back lever",
    "target": "upper back",
    "secondaryMuscles": [
        "biceps",
        "forearms",
        "core"
    ],
    "instructions": [
        "Start by hanging from a pull-up bar with an overhand grip, hands slightly wider than shoulder-width apart.",
        "Engage your core and pull your shoulder blades down and back.",
        "Bend your knees and tuck them towards your chest.",
        "Slowly lift your legs up, keeping them straight, until your body is parallel to the ground.",
        "Hold this position for a few seconds, then slowly lower your legs back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "back",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/0lG3JYcuWxPjdl",
    "id": "1405",
    "name": "back pec stretch",
    "target": "lats",
    "secondaryMuscles": [
        "shoulders",
        "chest"
    ],
    "instructions": [
        "Stand tall with your feet shoulder-width apart.",
        "Extend your arms straight out in front of you, parallel to the ground.",
        "Cross your arms in front of your body, with your right arm over your left arm.",
        "Interlock your fingers and rotate your palms away from your body.",
        "Slowly raise your arms up and away from your body, feeling a stretch in your back and chest.",
        "Hold the stretch for 15-30 seconds, then release.",
        "Repeat on the opposite side."
    ]
},
{
    "bodyPart": "back",
    "equipment": "band",
    "gifUrl": "https://v2.exercisedb.io/image/q2EXbWoEzrN2nh",
    "id": "0970",
    "name": "band assisted pull-up",
    "target": "lats",
    "secondaryMuscles": [
        "biceps",
        "forearms"
    ],
    "instructions": [
        "Attach the band to a pull-up bar or sturdy anchor point.",
        "Step onto the band and grip the bar with your palms facing away from you, hands slightly wider than shoulder-width apart.",
        "Hang with your arms fully extended, keeping your core engaged and your shoulders down and back.",
        "Pull your body up towards the bar by squeezing your shoulder blades together and driving your elbows down towards your hips.",
        "Continue pulling until your chin is above the bar, then slowly lower yourself back down to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
}
]
}
,
{
"name": "Cardio",
"plans": [
  {
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/T3O3ncFDN7-iQ6",
    "id": "3220",
    "name": "astride jumps (male)",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "calves"
    ],
    "instructions": [
        "Stand with your feet shoulder-width apart.",
        "Bend your knees and lower your body into a squat position.",
        "Jump explosively upwards, extending your legs and arms.",
        "While in the air, spread your legs apart and bring your arms out to the sides.",
        "Land softly with your feet shoulder-width apart, bending your knees to absorb the impact.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/U2iq9grTR5KBrp",
    "id": "3672",
    "name": "back and forth step",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "glutes",
        "calves"
    ],
    "instructions": [
        "Stand with your feet shoulder-width apart.",
        "Step forward with your right foot, bending your knee and lowering your body into a lunge position.",
        "Push off with your right foot and step back to the starting position.",
        "Repeat the movement with your left foot, alternating legs with each step.",
        "Continue stepping back and forth, maintaining a steady pace.",
        "Repeat for the desired duration or number of repetitions."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl":"https://v2.exercisedb.io/image/nCqVw8rnNea9Gq",
    "id": "3360",
    "name": "bear crawl",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "core",
        "shoulders",
        "triceps"
    ],
    "instructions": [
        "Start on all fours with your hands directly under your shoulders and your knees directly under your hips.",
        "Lift your knees slightly off the ground, keeping your back flat and your core engaged.",
        "Move your right hand and left foot forward simultaneously, followed by your left hand and right foot.",
        "Continue crawling forward, alternating your hand and foot movements.",
        "Maintain a steady pace and keep your core tight throughout the exercise.",
        "Continue for the desired distance or time."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/rCQKFXVFefno8O",
    "id": "1160",
    "name": "burpee",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "calves",
        "shoulders",
        "chest"
    ],
    "instructions": [
        "Start in a standing position with your feet shoulder-width apart.",
        "Lower your body into a squat position by bending your knees and placing your hands on the floor in front of you.",
        "Kick your feet back into a push-up position.",
        "Perform a push-up, keeping your body in a straight line.",
        "Jump your feet back into the squat position.",
        "Jump up explosively, reaching your arms overhead.",
        "Land softly and immediately lower back into a squat position to begin the next repetition."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "leverage machine",
    "gifUrl":"https://v2.exercisedb.io/image/OruRdPKoiD4hoz",
    "id": "2331",
    "name": "cycle cross trainer",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "glutes"
    ],
    "instructions": [
        "Adjust the seat height and position yourself on the cycle cross trainer.",
        "Place your feet on the pedals and grip the handlebars.",
        "Start pedaling in a smooth and controlled motion.",
        "Maintain a steady pace and increase the resistance if desired.",
        "Continue pedaling for the desired duration of your cardio workout."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "dumbbell",
    "gifUrl": "https://v2.exercisedb.io/image/pZEyh24R2L7QQs",
    "id": "1201",
    "name": "dumbbell burpee",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "calves",
        "shoulders",
        "triceps",
        "core"
    ],
    "instructions": [
        "Start in a standing position with your feet shoulder-width apart and a dumbbell in each hand.",
        "Lower your body into a squat position, placing the dumbbells on the ground in front of you.",
        "Kick your feet back into a push-up position, keeping your body in a straight line.",
        "Perform a push-up, bending your elbows and lowering your chest towards the ground.",
        "Jump your feet back towards your hands, landing in a squat position.",
        "Stand up explosively, lifting the dumbbells off the ground and bringing them to your shoulders.",
        "Press the dumbbells overhead, fully extending your arms.",
        "Lower the dumbbells back to your shoulders and repeat the entire sequence for the desired number of repetitions."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/7nIyz3e1DzbBsR",
    "id": "3221",
    "name": "half knee bends (male)",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "glutes"
    ],
    "instructions": [
        "Stand with your feet shoulder-width apart.",
        "Bend your knees and lower your body down as if you were sitting back into a chair.",
        "Keep your chest up and your weight in your heels.",
        "Pause for a moment at the bottom, then push through your heels to return to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/uQU8LmjLpGJ457",
    "id": "3636",
    "name": "high knee against wall",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "glutes",
        "calves"
    ],
    "instructions": [
        "Stand facing a wall with your feet hip-width apart.",
        "Place your hands on the wall for support.",
        "Engage your core and lift your right knee up towards your chest, while keeping your left foot on the ground.",
        "Quickly switch legs, bringing your left knee up towards your chest and lowering your right foot back down.",
        "Continue alternating legs in a running motion, bringing your knees up as high as possible.",
        "Maintain a fast pace and keep your upper body stable throughout the exercise.",
        "Repeat for the desired duration or number of repetitions."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/d4fJgZAxluTC7z",
    "id": "0501",
    "name": "jack burpee",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "hamstrings",
        "calves",
        "shoulders",
        "triceps",
        "core"
    ],
    "instructions": [
        "Start in a standing position with your feet shoulder-width apart.",
        "Lower your body into a squat position, placing your hands on the ground in front of you.",
        "Kick your feet back, landing in a push-up position.",
        "Perform a push-up, lowering your chest to the ground and then pushing back up.",
        "Jump your feet forward, landing in a squat position.",
        "Jump up explosively, reaching your arms overhead.",
        "Land softly and immediately lower back into the squat position to begin the next repetition."
    ]
},
{
    "bodyPart": "cardio",
    "equipment": "body weight",
    "gifUrl": "https://v2.exercisedb.io/image/uxH3k3BZpOAeKR",
    "id": "3224",
    "name": "jack jump (male)",
    "target": "cardiovascular system",
    "secondaryMuscles": [
        "quadriceps",
        "calves"
    ],
    "instructions": [
        "Stand with your feet together and your arms by your sides.",
        "Jump up, spreading your feet apart and raising your arms above your head.",
        "As you land, quickly jump back to the starting position.",
        "Repeat for the desired number of repetitions."
    ]
}
]
}

]
  
